import { IDrugCard } from '../types'

export const mockDrugCardsWithImg: Required<IDrugCard>[] = [
  {
    number: 1,
    text: (
      <>
        Ингибирует бронхоконстрикторные эффекты ацетилхолина, вступая с ним в
        конкурентный антагонизм за взаимодействие с эффекторными мускариновыми
        рецепторами, дополняет и потенцирует эффект β2-агонистов<sup>1</sup>
      </>
    ),
    title: (
      <>
        Ингаляционный <span>антихолинергик</span>
      </>
    ),
  },
  {
    number: 2,
    text: (
      <>
        Вызывает бронходилатацию посредством релаксации гладкомышечных клеток
        бронхов независимо от характера констриктивных стимулов, т. е. выступают
        в качестве функциональных антагонистов бронхоконстрикции
      </>
    ),
    title: (
      <>
        Ингаляционный <span>β2-агонист</span>
      </>
    ),
  },
  {
    number: 3,
    text: (
      <>
        Снижает частоту обострений, особенно в сочетании с ДДБА, подавляют
        хроническое воспаление при астме и снижают гиперреактивность дыхательных
        путей
      </>
    ),
    title: (
      <>
        Ингаляционный <span>глюкокортикостероид</span> (ИГКС)
      </>
    ),
  },
]

export const mockDrugCardsNoImg: IDrugCard[] = [
  {
    text: (
      <>
        Пациентам с ХОБЛ рекомендуется комбинирование бронходилататоров с
        разными механизмами действия; Назначение 2-х бронходилататоров из группы
        длительнодействующих β2-агонистов (ДДБА) и длительнодействующих
        антихолинергиков (ДДАХ), действие которых дополняет и усиливает друг
        друга<sup>1</sup>.
      </>
    ),
  },
  {
    text: (
      <>
        Пациентам с ХОБЛ и частыми обострениями (≥2 среднетяжелых обострений в
        течение 1 года/1 тяжелое обострение, потребовавшее госпитализации)
        рекомендуется назначение ИГКС в дополнение к ДДБА; Последние
        исследования показали, что амбулаторное применение ИГКС/ДДБА у пациентов
        с ХОБЛ снижает госпитальную летальность по сравнению с пациентами,
        принимавшими только ДДБА (8,1% vs 13,2%)<sup>1</sup>.
      </>
    ),
  },
]
